Revit 2024 API
DuctPressureDropData.Shape Property
 The profile type of the duct.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ConnectorProfileType Shape { get; }
Visual Basic
Public ReadOnly Property Shape As ConnectorProfileType
	Get
Visual C++
public:
property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace